examples/templates/cylinder2D_jets/system/funcObjForces
// Drag and lift coefficients on the cylinder wall, one sample per time step.

forces
{
    type            forceCoeffs;
    libs            ("libforces.so");
    log             false;

    executeControl  timeStep;
    executeInterval 1;
    writeControl    timeStep;
    writeInterval   1;

    patches         (cylinder);
    rhoInf          1;
    rho             rhoInf;
    CofR            (0 0 0);
    liftDir         (0 1 0);
    pitchAxis       (0 0 1);
    dragDir         (1 0 0);
    magUInf         1;
    lRef            1;
    Aref            1;
}
