examples/templates/cylinder2D_jets/system/funcObjProbes
// The 99 observation probes, as a plain functionObject.

probes
{
    type            probes;
    libs            ("libsampling.so");
    writeControl    timeStep;
    writeInterval   1;
    fixedLocations  true;
    interpolationScheme cellPoint;
    fields          (p);
    probeLocations
    (
        #include "probes"
    );
}
